package org.chat.utils;

import java.util.List;
import java.util.Optional;

public class FormulaUtil {

    private static final List<String> formulas = List.of("蜀椒","甘草干姜汤","甘姜苓术汤","一物瓜蒂汤","大黄附子汤","厚朴大黄汤","桂枝加厚朴杏子汤","桂枝加桂汤",
    "通脉四逆汤","大柴胡汤","柴胡桂枝干姜汤","小半夏茯苓汤","肾气丸","蜀漆散","白术附子汤","枳实芍药散","大黄硝石汤","栀子豉汤","桂枝麻黄各半汤","黄连阿胶汤",
    "桂枝加葛根汤","竹皮大丸","救卒死方","人参汤","越婢加半夏汤","桂枝去芍药加麻辛附子汤","柴胡桂姜汤","防己茯苓汤","瓜蒂汤","麻黄醇酒汤","厚朴生姜半夏甘草人参汤",
    "大建中汤","竹叶汤","橘枳姜汤","栀子大黄汤","排脓散","猪膏发煎","白头翁加甘草阿胶汤","栝蒌薤白半夏汤","文蛤汤","黄连粉","竹叶石膏汤","栝蒌薤白白酒汤",
    "半夏干姜散","栀子檗皮汤","黄耆桂枝五物汤","橘皮汤","救自缢死方","己椒苈黄丸","桂枝甘草龙骨牡蛎汤","大陷胸汤","茯苓四逆汤","桂枝附子汤","猪苓散","桂枝生姜枳实汤",
    "半夏麻黄丸","白头翁汤","桂枝去芍药汤","防己地黄汤","附子汤","小青龙汤","厚朴麻黄汤","射干麻黄汤","四逆汤","桂枝去芍药加附子汤","干姜附子汤","黄连汤","旋覆花汤",
    "小承气汤","薏苡附子败酱散","甘草附子汤","麻黄汤","泽漆汤","越婢加术汤","禹余粮丸","生姜甘草汤","大黄甘草","栀子甘草豉汤","崔氏八味丸","栀子生姜豉汤","小半夏汤",
    "柴胡桂枝汤","雄黄","茯苓甘草汤","百合地黄汤","甘草汤","百合知母汤","木防己汤去石膏加茯苓芒硝汤","白术散","白虎加桂枝汤","泻心汤","诃黎勒散","狼牙汤","附子泻心汤",
    "膏发煎","矾石汤","干姜人参半夏丸","桂枝汤加厚补","小建中汤","茯苓桂枝白术甘草汤","芍药甘草汤","小陷胸汤","桂枝加大黄汤","柏叶汤","紫参汤","乌梅丸","茯苓桂枝甘草大枣汤",
    "大半夏汤","甘麦大枣汤","桂枝去桂加茯苓白术汤","抵当乌头桂枝汤","黄土汤","当归贝母苦参丸","大陷胸丸","桂枝二麻黄一汤","黄芩加半夏生姜汤","桃花汤","麻黄杏子甘草石膏汤",
    "麻黄升麻汤","牡蛎汤","桂枝去芍药加皂荚汤","生姜半夏汤","柴胡去半夏加栝蒌汤","三黄汤","半夏厚朴汤","真武汤","赤石脂丸","续命汤","栀子干姜汤","柴胡加龙骨牡蛎汤",
    "栝蒌瞿麦丸","鸡屎白散","枳实薤白桂枝汤","桂枝人参汤","白虎汤","大青龙汤","赤小豆当归散","大乌头煎","胶艾汤","炙甘草汤","半夏散及汤","承气汤","桂枝加黄耆汤","阳旦汤",
    "矾石丸","温经汤","赤石脂禹余粮汤","黄芩汤","当归芍药散","奔豚汤","桃核承气汤","枳实栀子豉汤","四逆辈","甘草泻心汤","白通汤","葵子茯苓散","蜘蛛散","大承气汤","苓桂术甘汤",
    "侯氏黑散","橘皮竹茹","葛根汤","防己黄耆汤","麻黄杏仁甘草石膏汤","泽泻汤","硝石矾石散","栝蒌牡蛎散","蒲灰散","吴茱萸汤","猪肤汤","杏子汤","大黄黄连泻心汤","栀子厚朴汤",
    "白通加猪胆汁汤","薏苡附子散","柴胡加芒硝汤","瓜蒂散","茯苓泽泻汤","百合鸡子汤","烧晖散","麻黄附子细辛汤","蛇床子散","紫石寒食散","赤丸","苦酒汤","小柴胡汤","文蛤散",
    "四逆加人参汤","獭肝散","越婢汤","猪苓汤","桂枝加附子汤","救溺死方","桂枝二越婢一汤","滑石代赭汤","头风摩散","茯苓桂枝五味甘草汤","调胃承气汤","芍药甘草附子汤","当归生姜羊肉汤",
    "牡蛎泽泻散","干姜黄芩黄连人参汤","十枣汤","麻黄杏仁薏苡甘草汤","天雄散","百合洗方","耆芍桂酒汤","大黄䗪虫丸","桂枝加龙骨牡蛎汤","甘草麻黄汤","四逆散","百合滑石散","厚朴七物汤",
    "甘遂半夏汤","风引汤","麻黄附子汤","栝蒌桂枝汤方","桂枝加芍药生姜各一两人参三两新加汤","葶苈大枣泻肺汤","通脉四逆加猪胆汁汤","下瘀血汤","三物备急丸","酸枣仁汤","茵陈五苓散",
    "三物小陷胸汤","当归四逆汤","理中丸","桔梗白散","生姜泻心汤","旋覆代赭汤","茵陈蒿汤","桔梗汤","当归散","麻黄加术汤","抵当汤","术附汤","枳术汤","大黄甘遂汤","薯蓣丸","蜜煎",
    "黄耆建中汤","五苓散","茯苓杏仁甘草汤","藜芦甘草汤","诃黎勒丸","桂枝去芍药加蜀漆牡蛎龙骨救逆汤","葛根黄芩黄连汤","麻黄连翘赤小豆汤","桂枝汤","小半夏加茯苓汤","麻子仁丸","抵当丸",
    "去桂加白术汤","半夏泻心汤","麻黄附子甘草汤","乌头汤","附子粳米汤","鳖甲煎丸","桂枝甘草汤","桂枝加芍药汤","桂枝芍药知母汤","葛根加半夏汤","麦门冬汤","甘草粉蜜汤","苇茎汤","赤豆当归散",
    "白虎加人参汤","皂荚丸","土瓜根及大猪胆汁","九痛丸","红蓝花酒","王不留行散","土瓜根散","大黄牡丹汤","小青龙加石膏汤","厚朴三物汤","桂枝茯苓丸","升麻鳖甲汤","当归四逆加吴茱萸生姜汤");

    public static Optional<String> findFormula(String question) {
        return formulas.stream()
                .sorted((a, b) ->
                        Integer.compare(b.length(), a.length()))
                .filter(question::contains)
                .findFirst();
    }

}
